In [1]:
import pandas as df

In [2]:
siblings= df.DataFrame({"name": ["saurav", "tushar", "manali", "shiwani"], "age":[27,20,24,20], "fav_game": ["mini militia","pubg","temple run","subway surfer"]})

In [3]:
# Q1. List any five functions of the pandas library with execution.

In [4]:
siblings

      name  age       fav_game
0   saurav   27   mini militia
1   tushar   20           pubg
2   manali   24     temple run
3  shiwani   20  subway surfer

In [5]:
siblings.head(n = 2)

     name  age      fav_game
0  saurav   27  mini militia
1  tushar   20          pubg

In [6]:
siblings.tail(n=2)

      name  age       fav_game
2   manali   24     temple run
3  shiwani   20  subway surfer

In [7]:
siblings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      4 non-null      object
 1   age       4 non-null      int64
 2   fav_game  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [8]:
siblings.describe()

            age
count   4.00000
mean   22.75000
std     3.40343
min    20.00000
25%    20.00000
50%    22.00000
75%    24.75000
max    27.00000

In [9]:
siblings.shape

(4, 3)

In [10]:
"""Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row."""

"Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the\nDataFrame with a new index that starts from 1 and increments by 2 for each row."

In [11]:
siblings

      name  age       fav_game
0   saurav   27   mini militia
1   tushar   20           pubg
2   manali   24     temple run
3  shiwani   20  subway surfer

In [12]:
siblings.reindex(index=[1, 3, 5, 7])

      name   age       fav_game
1   tushar  20.0           pubg
3  shiwani  20.0  subway surfer
5      NaN   NaN            NaN
7      NaN   NaN            NaN

In [13]:
""" Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console."""

" Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that\niterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The\nfunction should print the sum to the console."

In [14]:
import pandas as pd

def sum_three(dataframe):
    return dataframe["values"].iloc[:3].sum()

data = {"values": [10, 20, 30, 40, 50]}
values = pd.DataFrame(data)  

result = sum_three(values)
print(result)

60

In [15]:
""" Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column. """

" Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column\n'Word_Count' that contains the number of words in each row of the 'Text' column. "

In [16]:
siblings["name"]

0     saurav
1     tushar
2     manali
3    shiwani
Name: name, dtype: object

In [17]:

def count(x):
    return len(x)

In [18]:
siblings['word_count_name'] = siblings["name"].apply (count)

In [19]:
siblings

      name  age       fav_game  word_count_name
0   saurav   27   mini militia                6
1   tushar   20           pubg                6
2   manali   24     temple run                6
3  shiwani   20  subway surfer                7

In [20]:
# Q5. How are DataFrame.size() and DataFrame.shape() different?

In [21]:
"""DataFRAME.size()--> Returns the multiplication of ROWS and COLUMNS."""

'DataFRAME.size()--> Returns the multiplication of ROWS and COLUMNS.'

In [22]:
siblings.size

16

In [23]:
"""DataFrame.shape--->  This attribute returns a tuple representing the dimensions of the DataFrame"""

'DataFrame.shape--->  This attribute returns a tuple representing the dimensions of the DataFrame'

In [24]:
siblings.shape

(4, 4)

In [25]:
# Q6. Which function of pandas do we use to read an excel file?

In [26]:
"""pd.read_excel("file_name")"""

'pd.read_excel("file_name")'

In [27]:
"""Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column."""

"Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email\naddresses in the format 'username@domain.com'. Write a Python function that creates a new column\n'Username' in df that contains only the username part of each email address.\nThe username is the part of the email address that appears before the '@' symbol. For example, if the\nemail address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your\nfunction should extract the username from each email address and store it in the new 'Username'\ncolumn."

In [28]:
siblings["Gmail"]= ["saurav27@gmail.com","tushar20@gmail.com","manali24@gmail.com","shivani11@gmail.com"]

In [29]:
siblings

      name  age       fav_game  word_count_name                Gmail
0   saurav   27   mini militia                6   saurav27@gmail.com
1   tushar   20           pubg                6   tushar20@gmail.com
2   manali   24     temple run                6   manali24@gmail.com
3  shiwani   20  subway surfer                7  shivani11@gmail.com

In [30]:
siblings["Gmail"].str.split('@').str[0]

0     saurav27
1     tushar20
2     manali24
3    shivani11
Name: Gmail, dtype: object

In [31]:
"""Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2  
Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows."""

"Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects\nall rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The\nfunction should return a new DataFrame that contains only the selected rows.\nFor example, if df contains the following values:\nA B C\n0 3 5 1\n1 8 2 7\n2 6 9 4\n3 2 3 5\n4 9 1 2  \nYour function should select the following rows: A B C\n1 8 2 7\n4 9 1 2\nThe function should return a new DataFrame that contains only the selected rows."

In [32]:
 DATA= df.DataFrame({"A":[3,8,6,2,9],'B': [5, 2, 9, 3, 1],
        'C': [1, 7, 4, 5, 2]})

In [33]:
 DATA

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [34]:
s = DATA.iloc[[1, 4],]

In [35]:
s

   A  B  C
1  8  2  7
4  9  1  2

In [36]:
"""Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.
"""

"Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,\nmedian, and standard deviation of the values in the 'Values' column.\n"

In [37]:
# ans
siblings

      name  age       fav_game  word_count_name                Gmail
0   saurav   27   mini militia                6   saurav27@gmail.com
1   tushar   20           pubg                6   tushar20@gmail.com
2   manali   24     temple run                6   manali24@gmail.com
3  shiwani   20  subway surfer                7  shivani11@gmail.com

In [38]:
siblings["age"].mean()

22.75

In [39]:
siblings["age"].median()

22.0

In [40]:
siblings["age"].std()

3.4034296427770228

In [41]:
"""Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day."""

"Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to\ncreate a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days\nfor each row in the DataFrame. The moving average should be calculated using a window of size 7 and\nshould include the current day."

In [7]:
import pandas as pd
def calculate_moving_average (df):
    df.sort_values(by = "Date", inplace = True)
    df["MovingAverage"]= df["Sales"].rolling(window = 7, min_periods = 1).mean()
    return df 
data = {'Date': ['2023-04-01', '2023-04-02', '2023-04-03', '2023-04-04', '2023-04-05',
                 '2023-04-06', '2023-04-07', '2023-04-08', '2023-04-09', '2023-04-10'],
        'Sales': [100, 150, 200, 175, 250, 300, 275, 350, 400, 375]}
df= pd.DataFrame(data)
df["date"]= pd.to_datetime(df["Date"])

In [8]:
calculate_moving_average (df)

         Date  Sales       date  MovingAverage
0  2023-04-01    100 2023-04-01     100.000000
1  2023-04-02    150 2023-04-02     125.000000
2  2023-04-03    200 2023-04-03     150.000000
3  2023-04-04    175 2023-04-04     156.250000
4  2023-04-05    250 2023-04-05     175.000000
5  2023-04-06    300 2023-04-06     195.833333
6  2023-04-07    275 2023-04-07     207.142857
7  2023-04-08    350 2023-04-08     242.857143
8  2023-04-09    400 2023-04-09     278.571429
9  2023-04-10    375 2023-04-10     303.571429

In [9]:
"""Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column."""

"Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new\ncolumn 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.\nMonday, Tuesday) corresponding to each date in the 'Date' column."

In [5]:
import pandas as pd
Date= {"Date": ['2023-04-01', '2023-04-02', '2023-04-03', '2023-04-04', '2023-04-05',
                 '2023-04-06', '2023-04-07', '2023-04-08', '2023-04-09', '2023-04-10']}
df= pd.DataFrame(Date)
df["Date"]= pd.to_datetime(df["Date"])
df["Weekday"]= df["Date"].dt.day_name()

In [6]:
df

        Date    Weekday
0 2023-04-01   Saturday
1 2023-04-02     Sunday
2 2023-04-03     Monday
3 2023-04-04    Tuesday
4 2023-04-05  Wednesday
5 2023-04-06   Thursday
6 2023-04-07     Friday
7 2023-04-08   Saturday
8 2023-04-09     Sunday
9 2023-04-10     Monday

In [7]:
"""Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'. """

"Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python\nfunction to select all rows where the date is between '2023-01-01' and '2023-01-31'. "

'The first and foremost necessary library that needs to be imported to use the basic functions of pandas is, of course, the pandas library itself. You need to import the pandas library at the beginning of your Python script or Jupyter Notebook in order to use its functions and data structures for data manipulation and analysis.'